{
  "citation": "Menezes, T., & Roth, C. (2021). Semantic Hypergraphs. arXiv:1908.10784v2 [cs.IR], 18 Feb 2021.",
  "annotation": "The paper proposes the Semantic Hypergraph (SH) as a hybrid, recursive, ordered-hypergraph representation that bridges symbolic and machine-learning approaches for natural-language understanding. It articulates a double open/opaque – strict/adaptive dichotomy, positions SH in the under-explored open-adaptive quadrant, and details its syntax, eight-type system, parsing pipeline (α-stage classifier + β-stage search), pattern language, and inference schemes. Empirical evaluations—open information extraction, taxonomy induction, co-reference and claim/conflict analysis—demonstrate SH’s explanatory power and competitive performance, offering an inspectable lingua-franca for interdisciplinary NLP research.",
  "theory_type": "cognitive / computational-linguistic / knowledge-representation",
  "vocabulary": [
    {
      "term": "Natural Language Processing (NLP)",
      "definition": "The field concerned with automatic processing and understanding of human language.",
      "source_context": "“Approaches to Natural language processing (NLP) may be classified along a double dichotomy open/opaque – strict/adaptive.”",
      "page_reference": null,
      "theoretical_category": "domain-field"
    },
    {
      "term": "open/opaque dichotomy",
      "definition": "Axis distinguishing whether internal processing rules of a system are inspectable (open) or not (opaque).",
      "source_context": "“The former axis relates to the possibility of inspecting the underlying processing rules.”",
      "page_reference": null,
      "theoretical_category": "meta-property"
    },
    {
      "term": "strict/adaptive dichotomy",
      "definition": "Axis distinguishing fixed-rule (strict) vs. data-driven, learning (adaptive) methods.",
      "source_context": "“the latter to the use of fixed or adaptive rules.”",
      "page_reference": null,
      "theoretical_category": "meta-property"
    },
    {
      "term": "open-adaptive quadrant",
      "definition": "Category of methods that are both inspectable and learning-based; the target of the SH approach.",
      "source_context": "“Our contribution takes steps in the open-adaptive direction.”",
      "page_reference": null,
      "theoretical_category": "research-gap"
    },
    {
      "term": "Semantic Hypergraph (SH)",
      "definition": "A recursive, ordered hypergraph model that represents linguistic meaning while tolerating ambiguity and enabling symbolic and statistical processing.",
      "source_context": "“The central idea of our approach is the Semantic Hypergraph (SH), a novel knowledge representation model that is intrinsically recursive and accommodates the natural hierarchical richness of natural language.”",
      "page_reference": null,
      "theoretical_category": "core-construct"
    },
    {
      "term": "knowledge representation",
      "definition": "Formal structuring of information so that it can be stored, processed and reasoned over.",
      "source_context": "“a formal language representation that reduces but tolerates ambiguity and structural variability.”",
      "page_reference": null,
      "theoretical_category": "core-construct"
    },
    {
      "term": "recursive hypergraph",
      "definition": "A hypergraph where hyperedges can themselves occur as vertices inside other hyperedges.",
      "source_context": "“Recursivity means that hyperedges can participate as vertices in other hyperedges.”",
      "page_reference": null,
      "theoretical_category": "structural-property"
    },
    {
      "term": "ordered hyperedge",
      "definition": "A hyperedge whose vertices are position-sensitive, enabling directed or functional interpretations.",
      "source_context": "“Ordering entails that the position in which a vertex participates in the hyperedge is relevant.”",
      "page_reference": null,
      "theoretical_category": "structural-property"
    },
    {
      "term": "atom",
      "definition": "Irreducible hyperedge of size one in SH; basic lexical item.",
      "source_context": "“V configures a set of irreducible hyperedges of size one i.e., atomic hyperedges which we also denote as atoms.”",
      "page_reference": null,
      "theoretical_category": "element-type"
    },
    {
      "term": "connector",
      "definition": "The first element of any non-atomic hyperedge that specifies how its arguments are semantically related.",
      "source_context": "“the first element in a non-atomic hyperedge must be a connector.”",
      "page_reference": null,
      "theoretical_category": "element-type"
    },
    {
      "term": "concept (type C)",
      "definition": "Atom representing a concrete or abstract entity expressible as a single word.",
      "source_context": "“The first...role that atoms can play is that of a concept... code is ‘C’.”",
      "page_reference": null,
      "theoretical_category": "type"
    },
    {
      "term": "predicate (type P)",
      "definition": "Connector encoding a relation, often corresponding to a verb.",
      "source_context": "“The most straightforward connector is the predicate, whose code is ‘P’. It is used to define relations.”",
      "page_reference": null,
      "theoretical_category": "type"
    },
    {
      "term": "modifier (type M)",
      "definition": "Connector that applies to exactly one hyperedge and produces another of the same type, modelling qualifiers like adjectives, adverbs or negations.",
      "source_context": "“The modifier type (‘M’) applies to one (and only one) existing hyperedge and defines a new hyperedge of the same type.”",
      "page_reference": null,
      "theoretical_category": "type"
    },
    {
      "term": "builder (type B)",
      "definition": "Connector that combines two or more concepts to construct a new composite concept.",
      "source_context": "“The builder type (‘B’) combines several concepts to create a new one.”",
      "page_reference": null,
      "theoretical_category": "type"
    },
    {
      "term": "special builder (+/B)",
      "definition": "Null-lexeme builder used to form compound nouns where words appear adjacent in text.",
      "source_context": "“we introduce a special builder atom that we call (+/B)... necessary to render such compound structures.”",
      "page_reference": null,
      "theoretical_category": "type-subclass"
    },
    {
      "term": "trigger (type T)",
      "definition": "Connector introducing a specification such as temporal, causal or conditional information to a relation.",
      "source_context": "“triggers (T), concerns additional specifications of a relationship, for example conditional (‘We go if it rains.’).”",
      "page_reference": null,
      "theoretical_category": "type"
    },
    {
      "term": "conjunction (type J)",
      "definition": "Connector that sequences or coordinates multiple hyperedges (e.g., and, but).",
      "source_context": "“Conjunctions (‘J’), like the English grammatical construct of the same name, join or coordinate concepts or relations.”",
      "page_reference": null,
      "theoretical_category": "type"
    },
    {
      "term": "relation (type R)",
      "definition": "Non-atomic hyperedge expressing a fact, statement, question or order; produced by predicates.",
      "source_context": "“Relations are typically used to state some fact... Relations are produced by predicates.”",
      "page_reference": null,
      "theoretical_category": "type"
    },
    {
      "term": "specifier (type S)",
      "definition": "Hyperedge that adds peripheral information (time, location, condition) to a relation; produced by triggers.",
      "source_context": "“Specifiers are types that play a more peripheral role... produced by triggers.”",
      "page_reference": null,
      "theoretical_category": "type"
    },
    {
      "term": "argument role",
      "definition": "Symbolic code indicating semantic function (e.g., subject, direct object) of each argument after a predicate or builder.",
      "source_context": "“We introduce a last notion that we employ to make meaning more explicit: argument roles for builders and predicates.”",
      "page_reference": null,
      "theoretical_category": "semantic-annotation"
    },
    {
      "term": "role code ‘s’",
      "definition": "Argument role denoting active subject.",
      "source_context": "Table 3 lists roles: ‘s’ active subject.",
      "page_reference": null,
      "theoretical_category": "role-value"
    },
    {
      "term": "role code ‘o’",
      "definition": "Argument role denoting direct object.",
      "source_context": "Table 3 includes direct object ‘o’.",
      "page_reference": null,
      "theoretical_category": "role-value"
    },
    {
      "term": "Dependency Parse Tree (DPT)",
      "definition": "Tree representation of grammatical relations derived from dependency grammar, used as intermediate structure in SH parsing.",
      "source_context": "“our own parser takes advantage of DPTs ... as intermediary steps.”",
      "page_reference": null,
      "theoretical_category": "related-construct"
    },
    {
      "term": "Universal Dependencies",
      "definition": "Cross-lingual set of dependency labels used to guarantee coverage of grammatical phenomena in SH.",
      "source_context": "“SH completeness is based instead on Universal Dependencies.”",
      "page_reference": null,
      "theoretical_category": "external-standard"
    },
    {
      "term": "α-stage (alpha stage)",
      "definition": "First parsing stage: a supervised classifier assigns one of six atomic SH types to each token.",
      "source_context": "“The first (α-stage) is a classifier that assigns a type to each token in a given sentence.”",
      "page_reference": null,
      "theoretical_category": "process-step"
    },
    {
      "term": "β-stage (beta stage)",
      "definition": "Second parsing stage: search-tree algorithm recursively applies SH type-inference patterns to assemble hyperedges.",
      "source_context": "“The second (β-stage) is a search tree-based algorithm that recursively applies the rules in table 2.”",
      "page_reference": null,
      "theoretical_category": "process-step"
    },
    {
      "term": "type inference rule",
      "definition": "Pattern specifying how connector and argument types determine resulting hyperedge type.",
      "source_context": "“Table 2 lists all type inference rules.”",
      "page_reference": null,
      "theoretical_category": "rule"
    },
    {
      "term": "pattern language (for SH)",
      "definition": "SH-internal syntax for expressing variable-bearing hyperedge templates used in matching and inference.",
      "source_context": "“We define a pattern language representable in SH itself.”",
      "page_reference": null,
      "theoretical_category": "formal-language"
    },
    {
      "term": "variable (in pattern)",
      "definition": "Placeholder symbol (capital letters) within a pattern that can match any hyperedge respecting optional type/role constraints.",
      "source_context": "“A variable simply indicates a placeholder that can match a hyperedge.”",
      "page_reference": null,
      "theoretical_category": "formal-element"
    },
    {
      "term": "inference rule (SH)",
      "definition": "Couple of SH patterns (lhs ` rhs) whose match triggers creation of new hyperedge(s) rewritten as rhs.",
      "source_context": "“We may now define rules which we denote with a couple of patterns separated by the symbol `.”",
      "page_reference": null,
      "theoretical_category": "rule"
    },
    {
      "term": "conjunction decomposition",
      "definition": "Process that expands relations containing conjunctions into simpler independent relations.",
      "source_context": "“We will manually define three such rules to perform conjunction decomposition.”",
      "page_reference": null,
      "theoretical_category": "operation"
    },
    {
      "term": "Open Information Extraction (OIE)",
      "definition": "Domain-independent extraction of relational tuples from text; used as benchmark task for SH patterns.",
      "source_context": "“One formulation of such a task ... is that of Open Information Extraction (OIE).”",
      "page_reference": null,
      "theoretical_category": "application-domain"
    },
    {
      "term": "random forest classifier",
      "definition": "Ensemble ML model of decision trees used in α-stage to map tokens to SH atomic types.",
      "source_context": "“used in combination with a random forest classifier and a simple search tree to parse NL to SH.”",
      "page_reference": null,
      "theoretical_category": "method-component"
    },
    {
      "term": "search tree (β-stage)",
      "definition": "Enumeration structure exploring candidate pattern applications to build hyperedges.",
      "source_context": "“β-stage ... a search tree-based algorithm that recursively applies the rules.”",
      "page_reference": null,
      "theoretical_category": "algorithmic-structure"
    },
    {
      "term": "heuristic function h",
      "definition": "Scoring function guiding β-stage when multiple pattern matches are possible, leveraging dependency connectivity.",
      "source_context": "“we use a heuristic function (this is function h in algorithm 1).”",
      "page_reference": null,
      "theoretical_category": "algorithmic-component"
    },
    {
      "term": "deep degree (δ)",
      "definition": "Metric counting connections of an edge considering recursive participation across nested hyperedges.",
      "source_context": "“Another useful metric that we can define is the deep degree, which considers edges connected by hyperedges not necessarily at the same level.”",
      "page_reference": null,
      "theoretical_category": "measure"
    },
    {
      "term": "hypergraphic degree (d)",
      "definition": "Number of outer hyperedges that include a given edge, summing (size-1) for each.",
      "source_context": "“We define the degree of a hyperedge e as d(e)=∑(|ei|−1).”",
      "page_reference": null,
      "theoretical_category": "measure"
    },
    {
      "term": "co-occurrence graph (of auxiliary concepts)",
      "definition": "Graph whose vertices are auxiliary concepts co-appearing with a seed in compound concepts, used for coreference.",
      "source_context": "“we build a graph of all the auxiliary concepts that appear together with the seed.”",
      "page_reference": null,
      "theoretical_category": "derived-structure"
    },
    {
      "term": "coreference set",
      "definition": "Group of compound concepts determined to refer to the same external entity via clique analysis and probability.",
      "source_context": "“The co-occurrence graph method produces the coreference sets seen on the right of the figure.”",
      "page_reference": null,
      "theoretical_category": "inferred-construct"
    },
    {
      "term": "probabilistic seed assignment",
      "definition": "Heuristic assigning ambiguous seed atom to a coreference set based on relative degree ratios.",
      "source_context": "“We thus establish a criterion ... seed is assigned to the coreference set C with the highest p if ...”",
      "page_reference": null,
      "theoretical_category": "heuristic-rule"
    },
    {
      "term": "claim predicate set",
      "definition": "List of predicate lemmas (e.g., say, claim) used to identify claim relations.",
      "source_context": "“we identified a set of ‘claim predicates’ ... considering the 100 most common predicate lemmas.”",
      "page_reference": null,
      "theoretical_category": "domain-lexicon"
    },
    {
      "term": "conflict predicate set",
      "definition": "Predicate lemmas such as accuse, condemn, clash used to mark expressions of conflict.",
      "source_context": "“set of ‘conflict predicates’, that we detail below.”",
      "page_reference": null,
      "theoretical_category": "domain-lexicon"
    },
    {
      "term": "actor detection",
      "definition": "Procedure identifying hyperedges whose role codes indicate agentive entities making claims/conflicts.",
      "source_context": "“Subjects and actors. Both claim and conflict structures imply that the hyperedge playing the role of subject ... is an actor.”",
      "page_reference": null,
      "theoretical_category": "task-definition"
    },
    {
      "term": "pattern learning template",
      "definition": "Human-in-the-loop iterative workflow: select hyperedge → annotate variables → generalize to pattern → match corpus → refine.",
      "source_context": "Figure 3 presents the general template for such a process.",
      "page_reference": null,
      "theoretical_category": "methodology"
    },
    {
      "term": "Graphbrain library",
      "definition": "Open-source software implementing SH structures, parser, inference and analysis routines.",
      "source_context": "“We created the Graphbrain open-source software library that implements all the ideas we described.”",
      "page_reference": null,
      "theoretical_category": "tool"
    },
    {
      "term": "lingua franca (for hybrid agents)",
      "definition": "Role of SH as common medium through which human, symbolic and statistical agents collaborate intelligibly.",
      "source_context": "“constitute a lingua franca, through which systems of cognitive agents of different natures can cooperate.”",
      "page_reference": null,
      "theoretical_category": "conceptual-goal"
    },
    {
      "term": "explainable artificial intelligence (XAI)",
      "definition": "Field aiming at AI methods whose decisions can be interpreted; SH contributes by being open and structured.",
      "source_context": "Keywords include ‘explainable artificial intelligence’.",
      "page_reference": null,
      "theoretical_category": "research-theme"
    },
    {
      "term": "pattern compression/generalization",
      "definition": "Process of merging multiple specific patterns into a more general pattern without over-generalising.",
      "source_context": "“We then compressed these 36 patterns into the most general ones.”",
      "page_reference": null,
      "theoretical_category": "pattern-operation"
    },
    {
      "term": "evaluation benchmark (WiRe57)",
      "definition": "External dataset for testing OIE systems against gold extractions.",
      "source_context": "“Table 7 shows the full benchmark, comparing the performance with seven other methods.”",
      "page_reference": null,
      "theoretical_category": "evaluation-resource"
    },
    {
      "term": "alpha classifier feature set F5",
      "definition": "Selected subset of 5 linguistic features (TAG, DEP, HDEP, HPOS, POS_AFTER) yielding highest accuracy.",
      "source_context": "“For subsequent experiments we will use F5, given that it has the best accuracy.”",
      "page_reference": null,
      "theoretical_category": "model-configuration"
    },
    {
      "term": "deep learning opacity",
      "definition": "Limitation wherein neural models’ reasoning is too complex for direct human inspection.",
      "source_context": "“adaptive models based on machine learning which are usually opaque to inspection.”",
      "page_reference": null,
      "theoretical_category": "problem-statement"
    },
    {
      "term": "automatic programming via statistical learning",
      "definition": "View that ML training produces complex programs equivalent to hand-written rules but generated adaptively.",
      "source_context": "“modern ML: the latter can be seen as a form of ‘automatic programming’ through large-scale statistical learning processes.”",
      "page_reference": null,
      "theoretical_category": "interpretive-insight"
    },
    {
      "term": "linguistic feature ablation",
      "definition": "Procedure removing features iteratively to evaluate impact on classifier accuracy.",
      "source_context": "“The iterative ablation procedure starts with the set of all candidate features.”",
      "page_reference": null,
      "theoretical_category": "experimental-method"
    },
    {
      "term": "genetic algorithm feature selection",
      "definition": "Evolutionary search over binary inclusion masks to find feature subset optimizing classifier accuracy.",
      "source_context": "“We tested two approaches for feature selection: a very simple genetic algorithm (GA).”",
      "page_reference": null,
      "theoretical_category": "algorithmic-method"
    },
    {
      "term": "specification edge",
      "definition": "Hyperedge of type S attached to a relation conveying contextual details such as time or condition.",
      "source_context": "“Specifications, as the name implies, add precisions to relations.”",
      "page_reference": null,
      "theoretical_category": "structural-unit"
    },
    {
      "term": "relative relation role ‘r’",
      "definition": "Argument role indicating that an argument is itself a nested relation functioning as clause.",
      "source_context": "“Finally, a relative relation is a nested relation, that acts as a building block of the outer relation.”",
      "page_reference": null,
      "theoretical_category": "role-value"
    },
    {
      "term": "hypergraph neighborhood Δe",
      "definition": "Recursive set of edges co-participating with edge e at any nesting depth, used for deep degree.",
      "source_context": "Algorithm 2 outlines GenerateΔ(e).",
      "page_reference": null,
      "theoretical_category": "derived-set"
    },
    {
      "term": "semantic deep starting point",
      "definition": "Point in processing pipeline where explicit meaning encoded in SH is available for downstream algorithms.",
      "source_context": "“It also provides a semantically deep starting point (in terms of explicit meaning) for further algorithms to operate.”",
      "page_reference": null,
      "theoretical_category": "processing-notion"
    },
    {
      "term": "catastrophic failure (parse)",
      "definition": "Parsing outcome where overall sentence meaning is lost due to erroneous classification or structure.",
      "source_context": "“failures of understanding catastrophic (we will see how this is not the case for SH).”",
      "page_reference": null,
      "theoretical_category": "error-type"
    },
    {
      "term": "defect size (relative)",
      "definition": "Ratio of size of defective subedge to total hyperedge size, used as error metric.",
      "source_context": "“This is simple the ratio of the size of the defective part to the size of the entire hyperedge.”",
      "page_reference": null,
      "theoretical_category": "metric"
    },
    {
      "term": "linguistic intelligibility compromise",
      "definition": "Design goal balancing human readability and machine tractability in SH.",
      "source_context": "“SH ... is a good compromise for intelligibility both for humans and machines.”",
      "page_reference": null,
      "theoretical_category": "design-principle"
    }
  ]
}